### Import DATA

In [3]:
import pandas as pd

In [12]:
groups1_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/groups1.csv')
groups2_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/groups2.csv')
categories_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/categories.csv')
cities_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/cities.csv', dtype={'zip': 'string'})

In [8]:
print("Groups 1 DataFrame:")
groups1_df.head()

Groups 1 DataFrame:

   group_id                           name  category_id  city_id
0      6388         Alternative Health NYC           14    10001
1      6510      Alternative Energy Meetup            4    10001
2      8458              NYC Animal Rights           26    10001
3      8940  The New York City Anime Group           29    10001
4     10104             NYC Pit Bull Group           26    10001

In [9]:
print("Groups 2 DataFrame:")
groups2_df.head()

Groups 2 DataFrame:

,group_id,name,category_id,city_id
0,18879327,BachataMania,5,10001
1,18880221,Photoshoot Chicago - Photography and Modeling ...,27,60601
2,18880426,Chicago Adult Push / Kick Scooter Group Riding...,31,60601
3,18880495,Chicago International Soccer Club,32,60601
4,18880695,Impact.tech San Francisco Meetup,2,94101

In [10]:
print("Categories DataFrame:")
categories_df.head()

Categories DataFrame:

   category_id            category_name
0            1           Arts & Culture
1            3       Cars & Motorcycles
2            4  Community & Environment
3            5                  Dancing
4            6     Education & Learning

In [13]:
print("Cities DataFrame:")
cities_df.head()

Cities DataFrame:

      id            city state    zip
0   7093   West New York    NJ  07093
1  10001        New York    NY  10001
2  13417  New York Mills    NY  13417
3  46312    East Chicago    IN  46312
4  56567  New York Mills    MN  56567

### Concatenating Data Sets

In [24]:
groups = pd.concat([groups1_df, groups2_df], ignore_index=True)
groups.shape

(16330, 4)

In [15]:
len(groups1_df) + len(groups2_df)

16330

In [20]:
print(pd.concat([groups1_df, groups2_df],keys=['group1','group2']))

             group_id                                               name  \
group1 0         6388                             Alternative Health NYC
       1         6510                          Alternative Energy Meetup
       2         8458                                  NYC Animal Rights
       3         8940                      The New York City Anime Group
       4        10104                                 NYC Pit Bull Group
...               ...                                                ...
group2 8326  26377464                                            Shinect
       8327  26377698  The art of getting what you want [conference s...
       8328  26378067                        Streeterville Running Group
       8329  26378128                                     Just Dance NYC
       8330  26378470           FREE Arabic Chicago Evanston North Burbs

             category_id  city_id
group1 0              14    10001
       1               4    10001
       2              26    10001
       3              29    10001
       4              26    10001
...                  ...      ...
group2 8326           34    94101
       8327           14    94101
       8328            9    60601
       8329           23    10001
       8330           31    60601

[16330 rows x 4 columns]

In [21]:
pd.concat([groups1_df, groups2_df],keys=['group1','group2'])

             group_id                                               name  \
group1 0         6388                             Alternative Health NYC
       1         6510                          Alternative Energy Meetup
       2         8458                                  NYC Animal Rights
       3         8940                      The New York City Anime Group
       4        10104                                 NYC Pit Bull Group
...               ...                                                ...
group2 8326  26377464                                            Shinect
       8327  26377698  The art of getting what you want [conference s...
       8328  26378067                        Streeterville Running Group
       8329  26378128                                     Just Dance NYC
       8330  26378470           FREE Arabic Chicago Evanston North Burbs

             category_id  city_id
group1 0              14    10001
       1               4    10001
       2              26    10001
       3              29    10001
       4              26    10001
...                  ...      ...
group2 8326           34    94101
       8327           14    94101
       8328            9    60601
       8329           23    10001
       8330           31    60601

[16330 rows x 4 columns]